In [1]:
import sqlite3

In [2]:
db = "../databases/moneyball.db"

In [3]:
%load_ext sql
%config SqlMagic.feedback=False
%sql sqlite:///{db}?check_same_thread=false
%sql SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:///../databases/moneyball.db?check_same_thread=false

[('players',), ('teams',), ('salaries',), ('performances',)]

In [5]:
%sql select * from players limit 2;

 * sqlite:///../databases/moneyball.db?check_same_thread=false

[(2, 'Hank', 'Aaron', 'R', 'R', 180, 72, '1954-04-13', '1976-10-03', 1934, 2, 5, 'Mobile', 'AL', 'USA'),
 (3, 'Tommie', 'Aaron', 'R', 'R', 190, 75, '1962-04-10', '1971-09-26', 1939, 8, 5, 'Mobile', 'AL', 'USA')]

In [6]:
%sql select * from teams limit 2;

 * sqlite:///../databases/moneyball.db?check_same_thread=false

[(1, 1884, 'Altoona Mountain City', None),
 (2, 2001, 'Anaheim Angels', 'Edison International Field')]

In [7]:
%sql select * from salaries limit 2;

 * sqlite:///../databases/moneyball.db?check_same_thread=false

[(1, 863, 4, 1985, 870000), (2, 1171, 4, 1985, 550000)]

In [8]:
%sql select * from performances limit 2;

 * sqlite:///../databases/moneyball.db?check_same_thread=false

[(1, 23, 134, 1871, 1, 4, 0, 0, 0, 0, 0, 0),
 (2, 115, 112, 1871, 25, 118, 32, 6, 0, 0, 13, 8)]

## 01 
You should start by getting a sense for how average player salaries have changed over time. In `1.sql`, write a SQL query to find the average player salary by year.

- Sort by year in descending order.
- Round the salary to two decimal places and call the column “average salary”.
- Your query should return a table with two columns, one for year and one for average salary.

In [9]:
%%sql
SELECT "year", ROUND(AVG("salary"),2) AS "average salary"
FROM "salaries"
GROUP BY "year"
ORDER BY "year" DESC;

 * sqlite:///../databases/moneyball.db?check_same_thread=false

[(2001, 2279841.06),
 (2000, 1992984.57),
 (1999, 1485316.85),
 (1998, 1280844.56),
 (1997, 1218687.44),
 (1996, 1027909.29),
 (1995, 964979.07),
 (1994, 1049588.56),
 (1993, 976966.56),
 (1992, 1047520.58),
 (1991, 894961.19),
 (1990, 511973.69),
 (1989, 506323.08),
 (1988, 453171.08),
 (1987, 434729.47),
 (1986, 417147.04),
 (1985, 476299.45)]

## 02 
Your general manager (i.e., the person who makes decisions about player contracts) asks you whether the team should trade a current player for Cal Ripken Jr., a star player who’s likely nearing his retirement. In `2.sql`, write a SQL query to find Cal Ripken Jr.’s salary history.

- Sort by year in descending order.
- Your query should return a table with two columns, one for year and one for salary.

In [13]:
%%sql
SELECT "year", "salary"
FROM "salaries"
WHERE "player_id" = (
    SELECT "id" FROM "players"
    WHERE "first_name" = 'Cal'
    AND "last_name" = 'Ripken'
)
ORDER BY "year" DESC;

 * sqlite:///../databases/moneyball.db?check_same_thread=false

[(2001, 6300000),
 (2000, 6300000),
 (1999, 6500000),
 (1998, 6400000),
 (1997, 6850000),
 (1996, 6650000),
 (1995, 6700000),
 (1994, 5500000),
 (1993, 5200000),
 (1992, 2100000),
 (1991, 2566667),
 (1990, 1316667),
 (1989, 2466667),
 (1988, 1700000),
 (1987, 1350000),
 (1986, 1150000),
 (1985, 800000)]

## 03 
Your team is going to need a great home run hitter. Ken Griffey Jr., a long-time Silver Slugger and Gold Glove award winner, might be a good prospect. In `3.sql`, write a SQL query to find Ken Griffey Jr.’s home run history.

- Sort by year in descending order.
- Note that there may be two players with the name “Ken Griffey.” This Ken Griffey was born in 1969.
- Your query should return a table with two columns, one for year and one for home runs.

In [14]:
%%sql
SELECT "year","HR" FROM "performances"
WHERE "player_id" = (
    SELECT "id" FROM "players"
    WHERE "first_name" = 'Ken'
    AND "last_name" = 'Griffey'
    AND "birth_year" = 1969
)
ORDER BY "year" DESC;

 * sqlite:///../databases/moneyball.db?check_same_thread=false

[(2001, 22),
 (2000, 40),
 (1999, 48),
 (1998, 56),
 (1997, 56),
 (1996, 49),
 (1995, 17),
 (1994, 40),
 (1993, 45),
 (1992, 27),
 (1991, 22),
 (1990, 22),
 (1989, 16)]

## 04 
You need to make a recommendation about which players the team should consider hiring. With the team’s dwindling budget, the general manager wants to know which players were paid the lowest salaries in 2001. In 4.sql, write a SQL query to find the 50 players paid the least in 2001.

- Sort players by salary, lowest to highest.
- If two players have the same salary, sort alphabetically by first name and then by last name.
- If two players have the same first and last name, sort by player ID.
- Your query should return three columns, one for players’ first names, one for their last names, and one for their salaries.

In [22]:
%%sql
SELECT
    "players"."first_name",
    "players"."last_name",
    "salaries"."salary"
FROM "players"
JOIN "salaries" ON "players"."id" = "salaries"."player_id"
WHERE "salaries"."year" = 2001
ORDER BY
    "salaries"."salary" ASC,
    "players"."first_name" ASC,
    "players"."last_name" ASC,
    "players"."id" ASC
LIMIT 50;

 * sqlite:///../databases/moneyball.db?check_same_thread=false

[('Albert', 'Pujols', 200000),
 ('Andy', 'Thompson', 200000),
 ('Ben', 'Sheets', 200000),
 ('Brad', 'Voyles', 200000),
 ('Brandon', 'Inge', 200000),
 ('Chris', 'Michalak', 200000),
 ('Chris', 'Reitsma', 200000),
 ('Chris', 'Seelbach', 200000),
 ('Christian', 'Parker', 200000),
 ('Courtney', 'Duncan', 200000),
 ("D'Angelo", 'Jimenez', 200000),
 ('Damian', 'Rolls', 200000),
 ('Damon', 'Minor', 200000),
 ('David', 'Eckstein', 200000),
 ('Donaldo', 'Mendez', 200000),
 ('Eddie', 'Oropesa', 200000),
 ('Gary', 'Glover', 200000),
 ('Hiram', 'Bocachica', 200000),
 ('Jack', 'Wilson', 200000),
 ('Jason', 'Grilli', 200000),
 ('Jay', 'Gibbons', 200000),
 ('Jermaine', 'Clark', 200000),
 ('Jimmy', 'Rollins', 200000),
 ('Joe', 'Beimel', 200000),
 ('John', 'Barnes', 200000),
 ('Jose', 'Nunez', 200000),
 ('Julio', 'Ramirez', 200000),
 ('Julio', 'Zuleta', 200000),
 ('Luis', 'Rivas', 200000),
 ('Luke', 'Prokopec', 200000),
 ('Luther', 'Hackman', 200000),
 ('Nate', 'Rolison', 200000),
 ('Nick', 'Bierbrodt', 200000),
 ('Paxton', 'Crawford', 200000),
 ('Randy', 'Choate', 200000),
 ('Ryan', 'Freel', 200000),
 ('Scott', 'Mullen', 200000),
 ('Scott', 'Seabol', 200000),
 ('Scott', 'Sobkowiak', 200000),
 ('Scott', 'Stewart', 200000),
 ('Shea', 'Hillenbrand', 200000),
 ('Tony', 'Cogan', 200000),
 ('Wally', 'Joyner', 200000),
 ('Willis', 'Roberts', 200000),
 ('Shawn', 'Wooten', 200500),
 ('Jose', 'Ortiz', 201000),
 ('Pedro', 'Feliz', 201000),
 ('Pablo', 'Ozuna', 202000),
 ('Scott', 'Winchester', 202000),
 ('Tim', 'Drew', 202000)]

## 05 
It’s a bit of a slow day in the office. Though Satchel no longer plays, in `5.sql` , write a SQL query to find all teams that Satchel Paige played for.

- Your query should return a table with a single column, one for the name of the teams.

In [32]:
%%sql
SELECT "name" FROM "teams"
WHERE "id" IN (
    SELECT "team_id" FROM "performances"
    WHERE "player_id" = (
        SELECT "id" FROM "players"
        WHERE "first_name" = 'Satchel'
        AND "last_name" = 'Paige'
    )
);

 * sqlite:///../databases/moneyball.db?check_same_thread=false

[('Cleveland Indians',), ('Kansas City Athletics',), ('St. Louis Browns',)]

## 06 
Which teams might be the biggest competition for the A’s this year? In `6.sql` , write a SQL query to return the top 5 teams, sorted by the total number of hits by players in 2001.

- Call the column representing total hits by players in 2001 “total hits”.
- Sort by total hits, highest to lowest.
- Your query should return two columns, one for the teams’ names and one for their total hits in 2001.

In [27]:
%%sql
SELECT * FROM "players"
        WHERE "first_name" = 'Satchel'
        AND "last_name" = 'Paige'

 * sqlite:///../databases/moneyball.db?check_same_thread=false

[(14190, 'Satchel', 'Paige', 'R', 'R', 180, 75, '1948-07-09', '1965-09-25', 1906, 7, 7, 'Mobile', 'AL', 'USA')]

In [31]:
%%sql
SELECT "team_id" FROM "performances"
WHERE "player_id" = 14190;

 * sqlite:///../databases/moneyball.db?check_same_thread=false

[(46,), (46,), (120,), (120,), (120,), (64,)]

In [ ]:
%sql select * from players limit 2;

 * sqlite:///../databases/moneyball.db?check_same_thread=false

[(2, 'Hank', 'Aaron', 'R', 'R', 180, 72, '1954-04-13', '1976-10-03', 1934, 2, 5, 'Mobile', 'AL', 'USA'),
 (3, 'Tommie', 'Aaron', 'R', 'R', 190, 75, '1962-04-10', '1971-09-26', 1939, 8, 5, 'Mobile', 'AL', 'USA')]

In [ ]:
%sql select * from teams limit 2;

 * sqlite:///../databases/moneyball.db?check_same_thread=false

[(1, 1884, 'Altoona Mountain City', None),
 (2, 2001, 'Anaheim Angels', 'Edison International Field')]

In [ ]:
%sql select * from salaries limit 2;

 * sqlite:///../databases/moneyball.db?check_same_thread=false

[(1, 863, 4, 1985, 870000), (2, 1171, 4, 1985, 550000)]

In [ ]:
%sql select * from performances limit 2;

 * sqlite:///../databases/moneyball.db?check_same_thread=false

[(1, 23, 134, 1871, 1, 4, 0, 0, 0, 0, 0, 0),
 (2, 115, 112, 1871, 25, 118, 32, 6, 0, 0, 13, 8)]